package com.ftm.server.common.utils;

import java.util.List;
import java.util.concurrent.ThreadLocalRandom;

public class RandomNickNameCreator {

    private static final int ADJECTIVE_SIZE = 100;
    private static final int ANIMAL_SIZE = 100;

    private static final List<String> ADJECTIVES =
            List.of(
                    "귀여운", "멋진", "사랑스러운", "친절한", "씩씩한", "활발한", "상냥한", "유쾌한", "웃기는", "엉뚱한", "도도한",
                    "시크한", "깜찍한", "착한", "말많은", "용감한", "천진난만한", "엉성한", "듬직한", "달콤한", "부드러운", "영리한",
                    "총명한", "통통 튀는", "재빠른", "고요한", "섬세한", "반짝이는", "튼튼한", "단단한", "활기찬", "청량한", "용감한",
                    "깨끗한", "상쾌한", "애교 많은", "신중한", "무뚝뚝한", "익살스러운", "어리숙한", "눈부신", "자유로운", "평화로운",
                    "느긋한", "발랄한", "늠름한", "새침한", "정많은", "상큼한", "놀라운", "행복한", "고집있는", "진지한", "명랑한",
                    "건강한", "감성적인", "논리적인", "활달한", "기특한", "온순한", "열정적인", "기운찬", "근엄한", "장난스러운",
                    "차분한", "엉뚱발랄한", "풍부한", "다정한", "순수한", "현명한", "현실적인", "적극적인", "낙천적인", "이성적인",
                    "창의적인", "겁먹은", "반짝반짝한", "대담한", "친근한", "자신감넘치는", "배려 깊은", "쾌활한", "낭만적인", "강직한",
                    "근면한", "용의주도한", "깨방정인", "활짝웃는", "배짱있는", "운동중인", "반짝이는", "차가운", "따뜻한", "달빛 같은",
                    "빛나는", "신비로운", "열렬한", "야무진", "물먹는", "밥먹는");

    private static final List<String> ANIMALS =
            List.of(
                    "고양이", "강아지", "호랑이", "사자", "토끼", "곰", "부엉이", "올빼미", "여우", "늑대", "다람쥐", "고슴도치",
                    "판다", "햄스터", "코끼리", "기린", "하마", "원숭이", "돼지", "소", "닭", "오리", "펭귄", "돌고래", "고래",
                    "상어", "물개", "바다표범", "너구리", "스컹크", "치타", "재규어", "카피바라", "알파카", "라마", "낙타",
                    "하이에나", "캥거루", "왈라비", "이구아나", "카멜레온", "악어", "도마뱀", "코알라", "수달", "너울고래", "족제비",
                    "삵", "담비", "멧돼지", "청설모", "기러기", "기러기", "참새", "까마귀", "까치", "앵무새", "홍학", "청둥오리",
                    "황새", "매", "독수리", "수리부엉이", "제비", "해달", "해파리", "문어", "낙지", "거북이", "자라", "이빨고기",
                    "복어", "불가사리", "연어", "잉어", "피라냐", "참치", "가오리", "도요새", "두루미", "삵쾡이", "바다사자", "사슴",
                    "노루", "염소", "양", "라마", "들소", "야크", "바이슨", "고라니", "아르마딜로", "너구리", "프레리도그", "페럿",
                    "고래상어", "벌", "나비", "잠자리", "딱정벌레");

    public static String generateNickname() {
        String adjective = ADJECTIVES.get(randomIndex(ADJECTIVE_SIZE));
        String animal = ANIMALS.get(randomIndex(ANIMAL_SIZE));
        int number = ThreadLocalRandom.current().nextInt(0, 1000); // 0~999

        return String.format("%s%s%d", adjective, animal, number);
    }

    private static int randomIndex(int size) {
        return ThreadLocalRandom.current().nextInt(size);
    }
}
